{
  "program": "nicy",
  "version": "0.1.1",
  "description": "Set the execution environment and configure the resources that spawned and running processes are allowed to share.",
  "usage": {
    "run": "run [OPTIONS]... COMMAND [ARGUMENTS]...",
    "show": "show [OPTIONS]... COMMAND",
    "list": "list [OPTIONS] CATEGORY",
    "rebuild": "rebuild",
    "install": "install [SHELL [SCRIPT_PATH]]",
    "manage": "manage [OPTIONS]"
  },
  "text": {
    "run": "Run the COMMAND in a pre-set execution environment.",
    "show": "Show the effective script for the given COMMAND and OPTIONS.",
    "list": "List the objects from this CATEGORY, removing all duplicates.",
    "rebuild": "Rebuild the json cache and exit.",
    "install": "Install scripts, using SHELL if any.",
    "manage": "Apply available presets, managing the running processes."
  },
  "options": {
    "run": [
      "-n, --dry-run        display commands but do not run them"
    ],
    "show": [
      "-q, --quiet          suppress additional output",
      "-v, --verbose        display which command is launched",
      "-p, --preset=PRESET  apply this PRESET",
      "-d, --default        like '--preset=default'",
      "-z, --cgroup-only    like '--preset=cgroup-only'",
      "-c, --cgroup=CGROUP  run inside this CGROUP",
      "    --cpu<QUOTA>     like '--cgroup=cpu<QUOTA>'",
      "-m, --managed        always run inside a scope",
      "-u, --force-cgroup   run inside a matching cgroup, if any"
    ],
    "list": [
      "-f, --from=DIRECTORY List only objects from this DIRECTORY"
    ],
    "rebuild": [],
    "install": [],
    "manage": [
      "    --user           inside the slice of the current user",
      "    --system         inside the system slice",
      "    --global         inside the global user slice",
      "    --all            inside either system or global user slice"
    ],
    "help": [
      "-h, --help           display this help and exit"
    ],
    "version": [
      "-v, --version        show the program version and exit"
    ]
  },
  "details":{
    "run": [
      "The PRESET argument can be: 'auto' to apply the specific preset for the command, its rule, if any; 'cgroup-only' to apply only the cgroup properties of that rule, if found; 'default' to apply the special fallback preset; or any generic preset, a type.",
      "The CGROUP argument can be a cgroup defined in configuration files.",
      "The QUOTA argument can be an integer ranging from 1 to 99 that represents a percentage relative to the total CPU time available on all cores."
    ],
    "show": [],
    "list": [
      "The CATEGORY argument can be 'rules', 'types' or 'cgroups', matching the extensions of configuration files.",
      "The DIRECTORY argument can be a path from NICY_SEARCH_DIRS setting. When filtering per DIRECTORY, no duplicate is removed taking into account the priority between directories."
    ],
    "install": [
      "The SHELL argument can be a path to a supported shell (sh, dash, bash, zsh). Default value is /bin/sh.",
      "The scripts are installed, when a specific rule is available, in SCRIPT_PATH, if given. Default value is $HOME/bin/nicy."
    ],
    "manage": [
      "The processes are managed when a specific rule is available.",
      "Root credentials are mandatory with --system, --global and --all options."
    ]
  }
}
